In [1]:
import pandas as pd
df = pd.read_csv('tested.csv')

In [2]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [4]:
row = len(df)
row

418

In [8]:
length_column = len(df.columns)
length_column

12

In [23]:
columns = df.columns
columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
male_count =df[df['Sex'] == 'male']
print(len(male_count))

266

In [19]:
female_count = df[df['Sex'] == 'female']
print(len(female_count))

152

In [40]:
survived_count = len(df[df['Survived'] == 1])
unsurvived_count = len(df[df['Survived'] == 0])
percentage_unsurviving = (unsurvived_count / row)*100
percentage_unsurviving

63.63636363636363

In [38]:
percentage_surviving = (survived_count /row)*100
percentage_surviving

36.36363636363637

In [41]:
df.colums == 'NaN'

AttributeError: 'DataFrame' object has no attribute 'colums'

In [ ]:
df.isnull().sum()